---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailure
source: html/72f56d1c-20b6-871a-11f5-323d7d31bbf4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailure Property

Fabrication Part Fitting Failed to Fit

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartFitFailure { get; }
```